
export const WORD_LISTS = [
    {
    id: 'grade6_tech_modern11',
    name: '下學期常用詞11,12,14',
    description: '醉心 刨 百折不撓 扭曲......',
    words: [
    "醉心", "刨", "百折不撓", "扭曲", "遺囑",
    "炸藥", "留神", "置身", "威脅", "研製",
    "依賴", "爆炸", "震盪", "屢次", "瀰漫", "頒發", "獎勵",
	    "敬慕","創建", "義務", "分佈",
	    "傳媒", "掙錢", "募款", "尊嚴", "服侍", "宗旨",
     "對稱", "寬敞", "邊沿",
    "屈曲", "着眼", "審美", "蔓延", "局部"
    ]
  },
{
    id: 'grade6_tech_modern49',
    name: '下學期常用詞4，9',
    description: '歌謠 水淋淋 悄然  ......',
    words: [
	    "歌謠", "水淋淋", "悄然", "屏住", "傾吐", "水窪", 
	    "餘韻", "飄灑", "輕捷", "優雅", "辨認", "忘卻", 
	    "宛若", "乾燥", "幽靜", "凝聚", "維艱", "綢繆", 
	    "瓦缶", "珍饈"
      ]
  },
{
    id: 'grade6_tech_modern12',
    name: '考試3常用詞',
    description: '資產 追隨者 敬慕  ......',
    words: [
	    "歌謠", "水淋淋", "悄然", "屏住", "傾吐", "水窪", 
	    "餘韻", "飄灑", "輕捷", "優雅", "辨認", "忘卻", 
	    "宛若", "乾燥", "幽靜", "凝聚", "維艱", "綢繆", 
	    "瓦缶", "珍饈", 
    "醉心", "刨", "百折不撓", "扭曲", "遺囑",
    "炸藥", "留神", "置身", "威脅", "研製",
    "依賴", "爆炸", "震盪", "屢次", "瀰漫", "頒發", "獎勵",
	    "敬慕","創建", "義務", "分佈",
	    "傳媒", "掙錢", "募款", "尊嚴", "服侍", "宗旨",
     "對稱", "寬敞", "邊沿",
    "屈曲", "着眼", "審美", "蔓延", "局部"
      ]
  },
{
    id: 'grade6_tech_modern17',
    name: '下學期常用詞17',
    description: '滿載 傷感......',
    words: [
	  "滿載","傷感","畢業","歷歷在目","拼搏",
    "衷心","彷徨","傳授","短暫","諾言","蓬勃"
    ]
  },
  {
    id: 'emotions',
    name: '下學期成語1-3',
    description: '玉石俱焚 旗鼓相當...',
    words: [
      "玉石俱焚", "刮目相看", "南轅北轍", "唇亡齒寒", "推心置腹", 
       "旗鼓相當", "覆水難收", "力挽狂瀾", "孤注一擲", "臥薪嘗膽",
      "約法三章", "重蹈覆轍", "集腋成裘", "雙管齊下", "審時度勢"
    ]
  },
  {
    id: 'idioms_nature',
    name: '下學期成語3',
    description: '約法三章 重蹈覆轍 集腋成裘 雙管齊下 審時度勢...',
    words: [
       "約法三章", "重蹈覆轍", "集腋成裘", "雙管齊下", "審時度勢"
    ]
  }
];

export const APP_TITLE = "六年級語文詞語運用測驗";
export const APP_SUBTITLE = "我是你的AI語文老師，選擇詞彙表或自訂題目，來挑戰看看你的詞彙運用能力吧！";
