
export const WORD_LISTS = [
  {
    id: 'grade6_tech_modern',
    name: '考試3',
    description: '"縱身", "逃命", "莊稼"',
    words: [
    "善解人意", "引領", "呈現", "避開", 
    "依據", "泄漏", "減低", "預示", "一日千里", "先進", "普及", "擔當", 
    "倘若", "驚訝", "無端", "至愛", "萬水千山","奮不顧身", 
    "反應", "倒塌", "設法", "畢竟", "廢墟", "救援", "區域", "慘痛", 
    "脚踏實地","自恃","持之以恆","精湛","告誡",
    "領悟","潛質","惋惜","實踐","傷殘","缺陷","歷程", 
    "躊躇滿志","尷尬","忠言逆耳","一笑置之","胸襟","疏忽","錯漏","婉轉",
    "鼓舞","難堪","忽略","導致","誤會","澄清","和睦"
    ]
  },
  {
    id: 'grade6_tech_modern2',
    name: '上學期常用詞17-22',
    description: '"縱身", "逃命", "莊稼"',
    words: [
    "尖端", "迎賓", "應付", 
    "自如", "觸屏", "善解人意", "監控", "引領", "呈現", "避開", 
    "依據", "泄漏", "減低", "預示", "一日千里", "先進", "普及", "擔當", 
    "妄棄", "疉", "倘若", "驚訝", "無端", "至愛", "萬水千山", "縱身",
    "逃命", "莊稼", "災場", "骨折", "關頭","鄉親", "奮不顧身", 
    "反應", "倒塌", "設法", "畢竟", "廢墟", "救援", "區域", "慘痛"
    ]
  },
  {
    id: 'grade6_default',
    name: '下學期常用詞7',
    description: '靈感,迷信,脚踏實地等常用語詞',
    words: [
       "靈感","迷信","脚踏實地","天賦","自恃","平庸",
      "持之以恆","精湛","刷新","澆灌","告誡",
      "領悟","潛質","惋惜","實踐","傷殘","缺陷","歷程"
    ]
  },
  {
    id: 'grade6_default2',
    name: '下學期常用詞8',
    description: '躊躇滿志,反唇相譏,尷尬等常用語詞',
    words: [
      "躊躇滿志","反唇相譏","尷尬","忠言逆耳","攻陷",
      "一笑置之","修心養性","胸襟","疏忽","錯漏","婉轉",
      "鼓舞","難堪","忽略","導致","誤會","澄清","和睦"
    ]
  },
  {
    id: 'emotions',
    name: '成語6',
    description: '肆無忌憚 墨守成規...',
    words: [
      "肆無忌憚", "墨守成規", "廢寢忘食", "興風作浪", "鍥而不捨"
    ]
  },
  {
    id: 'idioms_nature',
    name: '成語精選4-6',
    description: '肆無忌憚、墨守成規、萬念俱灰...',
    words: [
      "七竅生烟", "不寒而慄", "如坐針氈", "耿耿於懷", "庸人自擾",
      "萬念俱灰", "樂不思蜀", "驚惶失措", "好高騖遠", "虎頭蛇尾",
      "肆無忌憚", "墨守成規", "廢寢忘食", "興風作浪", "鍥而不捨"
    ]
  }
];

export const APP_TITLE = "六年級語文詞語運用測驗";
export const APP_SUBTITLE = "我是你的AI語文老師，選擇詞彙表或自訂題目，來挑戰看看你的詞彙運用能力吧！";
